'''
程式大綱：
1) 變數的記憶體位址
2) 串列的記憶體位址
3) = v.s. 淺複製 copy
'''

## 當兩個變數之值相同時，記憶體位址「相同」
x = 100
y = 100
print(id(x))  # 記憶體位址：2667131374928
print(id(y))  # 記憶體位址：2667131374928


## 當變數之值不同時，記憶體位址「重新配置」
y = 1

print(id(x))	# 記憶體位址：2667131374928
print(id(y))	# 記憶體位址：2667131371760


score = [1,2,3,4]
s = score         # s與score 的記憶體位址相同

print('-'*50, '1')
print(id(score))  # 記憶體位址：139805861333440
print(id(s))      # 記憶體位址：139805861333440

s[0] = 100        # ∵ s 與 score 的記憶體位址相同 ∴ s 改值後，score 也會跟著改
print('-'*50, '2')
print(id(score))  # 記憶體位址：134541760088512
print(id(s))      # 記憶體位址：134541760088512
print(score)      # [100, 2, 3, 4]
print(s)          # [100, 2, 3, 4]

print('-'*50, '3')
import copy

s2 = copy.copy(s)		# 一維陣列的複製，淺複製
print(id(s))        # 記憶體位址：138468198271424
print(id(s2))       # 記憶體位址：138468196737344
s2[0] = 9999
print(s)            # [100, 2, 3, 4]
print(s2)           # [9999, 2, 3, 4]
print(id(s))        # 記憶體位址：138468198271424
print(id(s2))       # 記憶體位址：138468196737344
