'''
程式大綱：串列的排序
1) sort：預設「小 → 大」、原本的串列『會』改變位置
2) sorted：預設「小 → 大」、原本的串列『不會』改變位置
'''

number = [1,4,7,20,80,40,20,10,3]

## sort 排序，預設小至大 ，原本位置會異動
number.sort()
print(number)    # [1, 3, 4, 7, 10, 20, 20, 40, 80]

## 由大至小排序，原本位置會異動
number.sort(reverse=True) 
print(number)    # [80, 40, 20, 20, 10, 7, 4, 3, 1]

##------------------------------分隔線------------------------------##
num = [1,4,7,20,80,40,20,10,3]

# 將排序後的結果交予 new_num ，num 本身不會變
new_num = sorted(num)                  # 預設小至大
desc_num = sorted(num,reverse=True)    # 大至小

print('原本：',num)                    # [1,4,7,20,80,40,20,10,3]
print('排序後:',new_num)               # [1, 3, 4, 7, 10, 20, 20, 40, 80]
print('遞減排序後:',desc_num)          # [80, 40, 20, 20, 10, 7, 4, 3, 1]

